STARTcloud/web-terminal/packaging/omnios/man/web-terminal.8
.Dd $Mdocdate$
.Dt WEB-TERMINAL 8
.Os
.Sh NAME
.Nm web-terminal
.Nd Web-based terminal interface
.Sh SYNOPSIS
.Nm
.Op Fl -help
.Op Fl -version
.Sh DESCRIPTION
The
.Nm
utility provides a web-based console access
.Pp
.Nm
is a Node.js Express application serving a React-based web interface that 
provides secure terminal access including:
.Bl -bullet -offset indent
.It
User authentication with OIDC and Basic Auth support
.It
JWT token-based session management
.It
WebSocket terminal connections
.It
xterm.js terminal interface
.It
SSL/TLS encryption with automatic certificate generation
.It
Token revocation and backchannel logout support
.El
.Pp
The service uses JWT token authentication for web sessions and provides
shell access through the browser.
.Sh CONFIGURATION
.Nm
reads its configuration from
.Pa /etc/web-terminal/config.yaml
by default. The configuration file uses YAML format and controls all aspects
of the service including network ports, SSL settings, database configuration,
user authentication, terminal settings, and OIDC providers.
.Pp
See
.Xr web-terminal.yaml 5
for detailed configuration file format documentation.
.Sh SERVICE MANAGEMENT
The
.Nm
service is managed through the Service Management Facility (SMF). Use the
following commands to control the service:
.Pp
.Dl # svcadm enable web-terminal
.Dl # svcadm disable web-terminal
.Dl # svcadm restart web-terminal
.Pp
Check service status:
.Pp
.Dl # svcs web-terminal
.Sh WEB INTERFACE
The service provides a modern React-based web interface accessible through
a standard web browser. The default access URL (configurable):
.Pp
.Dl https://localhost:PORT
.Pp
Key web interface features include:
.Bl -bullet -offset indent
.It
User login with OIDC or Basic authentication
.It
Web-based terminal interface using xterm.js
.It
Real-time terminal session via WebSocket
.It
Dark theme terminal display
.El
.Sh ENDPOINT DOCUMENTATION
The service provides endpoint documentation for developers.
Interactive endpoint documentation is available at:
.Pp
.Dl https://localhost:PORT/api-docs
.Pp
Key endpoint categories include:
.Bl -tag -width ".Pa /api/auth"
.It Pa /api/auth
User authentication and session management (OIDC and Basic auth)
.El
.Sh AUTHENTICATION
Web access uses JWT token-based authentication. Users authenticate via:
.Bl -bullet -offset indent
.It
OIDC providers (configured in config.yaml)
.It
Basic authentication (local users in config.yaml)
.El
.Pp
After successful authentication, users receive a JWT token stored in
an HTTP-only cookie for subsequent requests and WebSocket connections.
.Sh FILES
.Bl -tag -width ".Pa /var/lib/web-terminal/"
.It Pa /etc/web-terminal/config.yaml
Main configuration file
.It Pa /etc/web-terminal/ssl/
SSL certificate directory (auto-generated if enabled)
.It Pa /var/lib/web-terminal/
SQLite database directory for user data
.It Pa /var/log/web-terminal/
Service log directory
.It Pa /opt/web-terminal/
Installation directory
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
Start the service manually for testing:
.Bd -literal -offset indent
# cd /opt/web-terminal
# node app.js
.Ed
.Pp
Check web interface connectivity:
.Bd -literal -offset indent
# curl -k https://localhost:PORT/
.Ed
.Pp
Test authentication endpoint:
.Bd -literal -offset indent
# curl -k https://localhost:PORT/auth/methods
.Ed
.Sh DIAGNOSTICS
The service logs operational information to standard output when run manually,
or to SMF service logs when running under SMF management.
.Pp
Common diagnostic steps:
.Bl -enum -offset indent
.It
Check SMF service status: 
.Cm svcs -xv web-terminal
.It
Review service logs: 
.Cm svcs -L web-terminal
.It
Verify configuration syntax: 
.Cm node -c /opt/web-terminal/app.js
.It
Test network connectivity to configured port
.It
Verify database permissions and disk space
.El
.Sh SEE ALSO
.Xr web-terminal.yaml 5 ,
.Xr svcadm 8 ,
.Xr svcs 1
.Sh STANDARDS
The service follows REST architectural principles and returns JSON-formatted
responses. Authentication uses industry-standard JWT token mechanisms with
bcrypt hashing for secure password storage.
.Sh HISTORY
.Nm
first appeared in Web-Terminal 0.1.0
.\" x-release-please-version
.Sh AUTHORS
.An Web-Terminal Project
.Sh SECURITY
.Nm
implements several security measures:
.Bl -bullet -offset indent
.It
JWT token authentication with configurable expiration timeouts
.It
OIDC authentication with PKCE flow and backchannel logout
.It
SSL/TLS encryption with automatic certificate generation
.It
WebSocket authentication via JWT tokens
.It
Token revocation for compromised sessions
.It
CORS validation for web browser security
.It
Session management with automatic timeout
.El
.Pp
For production deployments, ensure:
.Bl -bullet -offset indent
.It
Strong JWT secret is configured and kept secure
.It
SSL certificates are properly configured or auto-generation is enabled
.It
OIDC providers are properly configured with valid client credentials
.It
Network access is appropriately restricted via firewall rules
.It
Database files have proper filesystem permissions
.It
Regular security updates and monitoring of user access patterns
.El
